import React, { useEffect, useState } from 'react'
import { useNavigate } from 'react-router-dom'
import Button from '../components/reusable/Button/Button'
import arginine from '../assets/arginine.png'
import alfaHerb from '../assets/alfaHerb.png'
import carnyPlus from '../assets/carnyPlus.png'
import css from './pages.module.css'

const demo = [
  {
    id: 1,
    product_id: 78,
    img: arginine,
    name: 'Arginine',
    title: 'Профілактика і лікування захворювань очей без ліків',
    article:
      "Щорічно збільшується кількість людей, які страждають від різних захворювань очей. В першу чергу, це пов'язано з постійно зростаючим потоком інформації, яку необхідно переробити за допомогою комп'ютера, або читанням спеціальної літератури. Сприяють погіршенню зору численні алергени, водіння автомобіля в нічний час, тривале перебування на сонці. Досить часто ураження очей обумовлено патологією внутрішніх органів та систем і є одним з проявів порушення обмінних процесів в організмі. Дефіцит у раціоні харчування таких мікронутрієнтів як вітаміни, мікроелементи, антиоксиданти, ненасичені жирні кислоти відіграють важливу, якщо не головну роль у патології органів зору. Вже в кінці минулого століття було встановлено достовірний зв'язок між забезпеченістю організму мікронутрієнтів антиоксидантної дії і деякими поширеними хронічними дегенеративними захворюваннями органів зору, такими як вікова макулодистрофія сітківки і катаракта, а також ураження сітківки у хворих, які отримують парентеральне (незбалансоване з багатьох мікронутрієнтів) харчування. Медикаментозне лікування при помутнінні кришталика (катаракти) передбачає поліпшення обмінних процесів у кришталику, заповнення нестачі різних речовин у кришталику, нормалізація метаболізму і окислювально-відновного балансу. Подібне лікування спрямоване на профілактику прогресування захворювання переважно в початковій стадії. Призначають лікарські засоби, що містять вітаміни В2, С, глутамінову кислоту, таурин, цистеїн і ін На більш пізніх стадіях захворювання проводять хірургічне втручання по заміні кришталика. При судинних, дистрофічних і запальних захворюваннях сітківки застосовують судинорозширювальні і поліпшують мікроциркуляцію препарати, спазмолітики, протинабрякові засоби, кортикостероїди. Важко піддається медикаментозному лікуванню таке грізне захворювання, як глаукома (патологія внутрішньоочного тиску). Призначають гіпотензивні препарати, діуретики, судинорозширювальні засоби, що поліпшують обмінні процеси в оці. При недостатній ефективності медикаментозного лікування показано лазерні та мікрохірургічні операції. Всі перераховані хронічні захворювання і потребують тривалого медикаментозного лікування, що завжди супроводжується побічними і небажаними ефектами для організму, тому застосування природних мікронутрієнтів та фітопрепаратів для лікування і профілактики даних захворювань досить актуально.",
    // Компанія Виталайн пропонує три препарати, що містять усі необхідні мікронутрієнти, що забезпечують антиоксидантний захист органів зору, а також беруть участь у процесах кольорового сприйняття і регулюють кровопостачання сітківки ока. Це Чорниця Віта Комплекс, Віта-Віжіон і Гінкго Білоба.
    // Основним компонентом препарату Чорниця Віта Комплекс є екстракт плодів чорниці, який містить фармакологічно активні антоцианідіни, зміцнюють стінки капілярів судинної оболонки, сітківки та попереджувальні дегенерацію жовтої плями сітківки. Чорниця підвищує гостроту і збільшує поле зору, зменшує втому очей від тривалої роботи при штучному освітленні.
    // Приймають Чорниця Віта Комплекс по 1 капсулі 3-4 рази в день протягом 1-2 місяців, після 2-3 тижневої перерви прийом препарату можна повторити.
    // Комплексний препарат Віта-Віжіон містить всі необхідні мікронутрієнти, що покращують роботу органів зору. Так, вітамін А або ретинол безпосередньо вказує на значення даного мікронутрієнта для зорової функції ока (retina — сітківка). При його дефіциті в організмі виснажується зоровий пігмент родопсин і розвивається так звана «куряча сліпота». Ретинол регулює процеси регенерації епітеліальних тканин, включаючи епітелій протоків слізних залоз.
    // У препараті містяться каротиноїди, необхідні для правильного функціонування органів зору. Лютеїн і зеаксантин або макулярные ксантофіли виконують функцію природних жовтих світлофільтрів, що запобігають пошкодження зорових клітин від синьої частини світлового спектра. Крім того, ці каротиноїди є ключовими антиоксидантами, що захищають сітківку від окисних процесів, викликаних світловим опроміненням. Ну, а бета-каротин є попередником вітаміну А.
    // Флавоноїди, що містяться в перерахованих вище препаратах, є активними антиоксидантами, пригнічують фотоокислительные процеси катарактогенеза (запобігають розвиток катаракти).
    // Приймають Віта-Віжіон по 1 капсулі 3 рази на день тривало.
    // Екстракти гінкго давно й успішно застосовуються для покращання мікроциркуляції. У зв'язку з цим препарат Гінкго Білоба перспективний при всіх порушеннях роботи органів зору, в тому числі для профілактики і в комплексних програмах лікування глаукоми. Це пов'язано з тим, що гінкго білоба нормалізує внутрішньоочної кровообіг і циркуляцію внутрішньоочної рідини, чинить антиагрегантну і нейропротекторну дію щодо зорового нерва. Антиоксидантну дію екстракту гінкго також яскраво виражено.
    // Приймають Гінкго Білоба по 2 капсули 2 рази на день у першій половині дня протягом 1-2 місяців, роблять перерву на 2-3 тижні, потім прийом препарату можна повторити.
    // Примітка. Додатково до основної схемою рекомендуємо приймати Мега Плюс по 1 капсулі 2-3 рази на день, оскільки омега-3-поліненасичені жирні кислоти відіграють дуже важливу роль для функціонування зорових клітин і для процесу кольорового сприйняття, зокрема. Препарат бажано приймати разом з Супер Е (по 1 капсулі в день) і З Супер (по 2-3 таблетки на день одноразово) для попередження окислення поліненасичених жирних кислот.",
  },
  {
    id: 2,
    product_id: 72,
    img: alfaHerb,
    name: 'Alfa Herb',
    title: 'Трохи про нашому "Залозі эссенсеальном"',
    article:
      "Щорічно збільшується кількість людей, які страждають від різних захворювань очей. В першу чергу, це пов'язано з постійно зростаючим потоком інформації, яку необхідно переробити за допомогою комп'ютера, або читанням спеціальної літератури. Сприяють погіршенню зору численні алергени, водіння автомобіля в нічний час, тривале перебування на сонці. Досить часто ураження очей обумовлено патологією внутрішніх органів та систем і є одним з проявів порушення обмінних процесів в організмі. Дефіцит у раціоні харчування таких мікронутрієнтів як вітаміни, мікроелементи, антиоксиданти, ненасичені жирні кислоти відіграють важливу, якщо не головну роль у патології органів зору. Вже в кінці минулого століття було встановлено достовірний зв'язок між забезпеченістю організму мікронутрієнтів антиоксидантної дії і деякими поширеними хронічними дегенеративними захворюваннями органів зору, такими як вікова макулодистрофія сітківки і катаракта, а також ураження сітківки у хворих, які отримують парентеральне (незбалансоване з багатьох мікронутрієнтів) харчування. Медикаментозне лікування при помутнінні кришталика (катаракти) передбачає поліпшення обмінних процесів у кришталику, заповнення нестачі різних речовин у кришталику, нормалізація метаболізму і окислювально-відновного балансу. Подібне лікування спрямоване на профілактику прогресування захворювання переважно в початковій стадії. Призначають лікарські засоби, що містять вітаміни В2, С, глутамінову кислоту, таурин, цистеїн і ін На більш пізніх стадіях захворювання проводять хірургічне втручання по заміні кришталика. При судинних, дистрофічних і запальних захворюваннях сітківки застосовують судинорозширювальні і поліпшують мікроциркуляцію препарати, спазмолітики, протинабрякові засоби, кортикостероїди. Важко піддається медикаментозному лікуванню таке грізне захворювання, як глаукома (патологія внутрішньоочного тиску). Призначають гіпотензивні препарати, діуретики, судинорозширювальні засоби, що поліпшують обмінні процеси в оці. При недостатній ефективності медикаментозного лікування показано лазерні та мікрохірургічні операції. Всі перераховані хронічні захворювання і потребують тривалого медикаментозного лікування, що завжди супроводжується побічними і небажаними ефектами для організму, тому застосування природних мікронутрієнтів та фітопрепаратів для лікування і профілактики даних захворювань досить актуально.",
  },
  {
    id: 3,
    product_id: 79,
    img: carnyPlus,
    name: 'Super C',
    title: 'Солодка Плюс (Лакричник) / Licorice',
    article:
      "Щорічно збільшується кількість людей, які страждають від різних захворювань очей. В першу чергу, це пов'язано з постійно зростаючим потоком інформації, яку необхідно переробити за допомогою комп'ютера, або читанням спеціальної літератури. Сприяють погіршенню зору численні алергени, водіння автомобіля в нічний час, тривале перебування на сонці. Досить часто ураження очей обумовлено патологією внутрішніх органів та систем і є одним з проявів порушення обмінних процесів в організмі. Дефіцит у раціоні харчування таких мікронутрієнтів як вітаміни, мікроелементи, антиоксиданти, ненасичені жирні кислоти відіграють важливу, якщо не головну роль у патології органів зору. Вже в кінці минулого століття було встановлено достовірний зв'язок між забезпеченістю організму мікронутрієнтів антиоксидантної дії і деякими поширеними хронічними дегенеративними захворюваннями органів зору, такими як вікова макулодистрофія сітківки і катаракта, а також ураження сітківки у хворих, які отримують парентеральне (незбалансоване з багатьох мікронутрієнтів) харчування. Медикаментозне лікування при помутнінні кришталика (катаракти) передбачає поліпшення обмінних процесів у кришталику, заповнення нестачі різних речовин у кришталику, нормалізація метаболізму і окислювально-відновного балансу. Подібне лікування спрямоване на профілактику прогресування захворювання переважно в початковій стадії. Призначають лікарські засоби, що містять вітаміни В2, С, глутамінову кислоту, таурин, цистеїн і ін На більш пізніх стадіях захворювання проводять хірургічне втручання по заміні кришталика. При судинних, дистрофічних і запальних захворюваннях сітківки застосовують судинорозширювальні і поліпшують мікроциркуляцію препарати, спазмолітики, протинабрякові засоби, кортикостероїди. Важко піддається медикаментозному лікуванню таке грізне захворювання, як глаукома (патологія внутрішньоочного тиску). Призначають гіпотензивні препарати, діуретики, судинорозширювальні засоби, що поліпшують обмінні процеси в оці. При недостатній ефективності медикаментозного лікування показано лазерні та мікрохірургічні операції. Всі перераховані хронічні захворювання і потребують тривалого медикаментозного лікування, що завжди супроводжується побічними і небажаними ефектами для організму, тому застосування природних мікронутрієнтів та фітопрепаратів для лікування і профілактики даних захворювань досить актуально.",
  },
]

const ArticlesPage = () => {
  const [articles, setArticles] = useState([])
  const [active, setActive] = useState([])
  const navigate = useNavigate()

  useEffect(() => {
    setArticles(demo)
    document.title = 'Vitaline'
  }, [])

  const handleToggle = (id, e) => {
    if (active.find((el) => +el === +id))
      return setActive(active.filter((el) => +el !== +id))

    setActive([...active, id])
  }

  const goToProduct = (id, e) =>
    setTimeout(() => {
      navigate(`/product/${id}`)
    }, 300)

  return (
    <main className={css.main}>
      {articles.length > 0 && (
        <div className={css.articlesWrapper}>
          <ul>
            {articles.map((el) => (
              <li key={el.id}>
                <article className={css.article}>
                  <div
                    className={`${css.article_trigger} ${
                      active.find((i) => +i === +el.id)
                        ? css.article_trigger__active
                        : ''
                    }`}
                  ></div>
                  <div className={css.article_header}>
                    <img
                      className={css.article_img}
                      alt="product"
                      src={el.img}
                    />
                    <div className={css.article_header__text}>
                      <h2 className={css.article_header__name}>{el.name}</h2>
                      <h2 className={css.article_header__title}>{el.title}</h2>
                      <div className={css.article_header__btns}>
                        <Button
                          styled="invert"
                          onClick={goToProduct.bind(this, el.product_id)}
                          rippled
                        >
                          До товару
                        </Button>
                        <Button
                          styled="invert"
                          onClick={handleToggle.bind(this, el.id)}
                          rippled
                        >
                          {active.find((i) => +i === +el.id)
                            ? 'Закрити статтю'
                            : 'Читати статтю'}
                        </Button>
                      </div>
                    </div>
                  </div>
                  <div
                    className={`${css.article_text__wrapper} ${
                      active.find((i) => +i === +el.id)
                        ? css.article_text__wrapper__active
                        : ''
                    }`}
                  >
                    <p className={css.article_text}>{el.article}</p>
                  </div>
                </article>
              </li>
            ))}
          </ul>
        </div>
      )}
    </main>
  )
}

export default ArticlesPage
