import React, { useEffect } from 'react'
import Card from '../components/Card/Card'
import alfaHerb from '../assets/alfaHerb.png'
import arginine from '../assets/arginine.png'
import brain from '../assets/brain.png'
import candiTrim from '../assets/candiTrim.png'
import carnyPlus from '../assets/carnyPlus.png'
import catsClawRoot from '../assets/catsClawRoot.png'
import chitoTrim from '../assets/chitoTrim.png'
import citrusPectin from '../assets/citrusPectin.png'
import colonCare from '../assets/colonCare.png'
import cranberry from '../assets/cranberry.png'
import dairyzyme from '../assets/dairyzyme.png'
import glutamine from '../assets/glutamine.png'
import healthyChromium from '../assets/healthyChromium.png'
import longLife from '../assets/longLife.png'
import nac from '../assets/nac.png'
import q10 from '../assets/q10.png'
import relax from '../assets/relax.png'
import tryptophan from '../assets/tryptophan.png'
import vitaHelp from '../assets/vitaHelp.png'
import vitaVision from '../assets/vitaVision.png'
import vitazyme from '../assets/vitazyme.png'
import css from './pages.module.css'

const products = [
  {
    id: 1,
    img: alfaHerb,
    name: 'Alfa Herb',
    description:
      'Кембриджское харчування — це низькокалорійне харчування, що містить повний набір необхідних людському організму вітамінів, мінеральних речовин, вуглеводів, амінокислот та інших елементів, визначений міжнародними стандартами. В одній порції Кембриджського харчування міститься 140 калорій.',
    price: '20$',
  },
  {
    id: 2,
    img: arginine,
    name: 'Super C',
    description:
      'Кембриджское харчування — це низькокалорійне харчування, що містить повний набір необхідних людському організму вітамінів, мінеральних речовин, вуглеводів, амінокислот та інших елементів, визначений міжнародними стандартами. В одній порції Кембриджського харчування міститься 140 калорій.',
    price: '20$',
  },
  {
    id: 3,
    img: brain,
    name: 'Super C',
    description:
      'Кембриджское харчування — це низькокалорійне харчування, що містить повний набір необхідних людському організму вітамінів, мінеральних речовин, вуглеводів, амінокислот та інших елементів, визначений міжнародними стандартами. В одній порції Кембриджського харчування міститься 140 калорій.',
    price: '20$',
  },
  {
    id: 4,
    img: candiTrim,
    name: 'Super C',
    description:
      'Кембриджское харчування — це низькокалорійне харчування, що містить повний набір необхідних людському організму вітамінів, мінеральних речовин, вуглеводів, амінокислот та інших елементів, визначений міжнародними стандартами. В одній порції Кембриджського харчування міститься 140 калорій.',
    price: '20$',
  },
  {
    id: 5,
    img: carnyPlus,
    name: 'Super C',
    description:
      'Кембриджское харчування — це низькокалорійне харчування, що містить повний набір необхідних людському організму вітамінів, мінеральних речовин, вуглеводів, амінокислот та інших елементів, визначений міжнародними стандартами. В одній порції Кембриджського харчування міститься 140 калорій.',
    price: '20$',
  },
  {
    id: 6,
    img: catsClawRoot,
    name: 'Super C',
    description:
      'Кембриджское харчування — це низькокалорійне харчування, що містить повний набір необхідних людському організму вітамінів, мінеральних речовин, вуглеводів, амінокислот та інших елементів, визначений міжнародними стандартами. В одній порції Кембриджського харчування міститься 140 калорій.',
    price: '20$',
  },
  {
    id: 7,
    img: chitoTrim,
    name: 'Super C',
    description:
      'Кембриджское харчування — це низькокалорійне харчування, що містить повний набір необхідних людському організму вітамінів, мінеральних речовин, вуглеводів, амінокислот та інших елементів, визначений міжнародними стандартами. В одній порції Кембриджського харчування міститься 140 калорій.',
    price: '20$',
  },
  {
    id: 8,
    img: citrusPectin,
    name: 'Super C',
    description:
      'Кембриджское харчування — це низькокалорійне харчування, що містить повний набір необхідних людському організму вітамінів, мінеральних речовин, вуглеводів, амінокислот та інших елементів, визначений міжнародними стандартами. В одній порції Кембриджського харчування міститься 140 калорій.',
    price: '20$',
  },
  {
    id: 9,
    img: colonCare,
    name: 'Super C',
    description:
      'Кембриджское харчування — це низькокалорійне харчування, що містить повний набір необхідних людському організму вітамінів, мінеральних речовин, вуглеводів, амінокислот та інших елементів, визначений міжнародними стандартами. В одній порції Кембриджського харчування міститься 140 калорій.',
    price: '20$',
  },
  {
    id: 10,
    img: cranberry,
    name: 'Super C',
    description:
      'Кембриджское харчування — це низькокалорійне харчування, що містить повний набір необхідних людському організму вітамінів, мінеральних речовин, вуглеводів, амінокислот та інших елементів, визначений міжнародними стандартами. В одній порції Кембриджського харчування міститься 140 калорій.',
    price: '20$',
  },
  {
    id: 11,
    img: dairyzyme,
    name: 'Super C',
    description:
      'Кембриджское харчування — це низькокалорійне харчування, що містить повний набір необхідних людському організму вітамінів, мінеральних речовин, вуглеводів, амінокислот та інших елементів, визначений міжнародними стандартами. В одній порції Кембриджського харчування міститься 140 калорій.',
    price: '20$',
  },
  {
    id: 12,
    img: glutamine,
    name: 'Super C',
    description:
      'Кембриджское харчування — це низькокалорійне харчування, що містить повний набір необхідних людському організму вітамінів, мінеральних речовин, вуглеводів, амінокислот та інших елементів, визначений міжнародними стандартами. В одній порції Кембриджського харчування міститься 140 калорій.',
    price: '20$',
  },
  {
    id: 13,
    img: healthyChromium,
    name: 'Super C',
    description:
      'Кембриджское харчування — це низькокалорійне харчування, що містить повний набір необхідних людському організму вітамінів, мінеральних речовин, вуглеводів, амінокислот та інших елементів, визначений міжнародними стандартами. В одній порції Кембриджського харчування міститься 140 калорій.',
    price: '20$',
  },
  {
    id: 14,
    img: longLife,
    name: 'Super C',
    description:
      'Кембриджское харчування — це низькокалорійне харчування, що містить повний набір необхідних людському організму вітамінів, мінеральних речовин, вуглеводів, амінокислот та інших елементів, визначений міжнародними стандартами. В одній порції Кембриджського харчування міститься 140 калорій.',
    price: '20$',
  },
  {
    id: 15,
    img: nac,
    name: 'Super C',
    description:
      'Кембриджское харчування — це низькокалорійне харчування, що містить повний набір необхідних людському організму вітамінів, мінеральних речовин, вуглеводів, амінокислот та інших елементів, визначений міжнародними стандартами. В одній порції Кембриджського харчування міститься 140 калорій.',
    price: '20$',
  },
  {
    id: 16,
    img: q10,
    name: 'Super C',
    description:
      'Кембриджское харчування — це низькокалорійне харчування, що містить повний набір необхідних людському організму вітамінів, мінеральних речовин, вуглеводів, амінокислот та інших елементів, визначений міжнародними стандартами. В одній порції Кембриджського харчування міститься 140 калорій.',
    price: '20$',
  },
  {
    id: 17,
    img: relax,
    name: 'Super C',
    description:
      'Кембриджское харчування — це низькокалорійне харчування, що містить повний набір необхідних людському організму вітамінів, мінеральних речовин, вуглеводів, амінокислот та інших елементів, визначений міжнародними стандартами. В одній порції Кембриджського харчування міститься 140 калорій.',
    price: '20$',
  },
  {
    id: 18,
    img: tryptophan,
    name: 'Super C',
    description:
      'Кембриджское харчування — це низькокалорійне харчування, що містить повний набір необхідних людському організму вітамінів, мінеральних речовин, вуглеводів, амінокислот та інших елементів, визначений міжнародними стандартами. В одній порції Кембриджського харчування міститься 140 калорій.',
    price: '20$',
  },
  {
    id: 19,
    img: vitaHelp,
    name: 'Super C',
    description:
      'Кембриджское харчування — це низькокалорійне харчування, що містить повний набір необхідних людському організму вітамінів, мінеральних речовин, вуглеводів, амінокислот та інших елементів, визначений міжнародними стандартами. В одній порції Кембриджського харчування міститься 140 калорій.',
    price: '20$',
  },
  {
    id: 20,
    img: vitaVision,
    name: 'Super C',
    description:
      'Кембриджское харчування — це низькокалорійне харчування, що містить повний набір необхідних людському організму вітамінів, мінеральних речовин, вуглеводів, амінокислот та інших елементів, визначений міжнародними стандартами. В одній порції Кембриджського харчування міститься 140 калорій.',
    price: '20$',
  },
  {
    id: 21,
    img: vitazyme,
    name: 'Super C',
    description:
      'Кембриджское харчування — це низькокалорійне харчування, що містить повний набір необхідних людському організму вітамінів, мінеральних речовин, вуглеводів, амінокислот та інших елементів, визначений міжнародними стандартами. В одній порції Кембриджського харчування міститься 140 калорій.',
    price: '20$',
  },
]

const ProductsPage = () => {
  useEffect(() => {}, [])

  return (
    <main className={css.main}>
      <div className={css.parallax}></div>
      <section className={css.cardList}>
        {products.map((product, i) => (
          <Card key={product.id} i={i} product={product} />
        ))}
      </section>
    </main>
  )
}

export default ProductsPage
